{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.4.0",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, null, 3],
              "dtype": "float32",
              "sparse": false,
              "name": "vgg_input"
            },
            "name": "vgg_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Preprocess",
            "config": {
              "name": "preprocess",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wEAAAAAAAAAAQAAAAQAAABTAAAAcxgAAAB0AGoBfABkBGcBZAKNAmQDFAB0AhgAUwApBU7pAQAA\nACkB2gRheGlzZwAAAAAA4G9A6f////8pA9oCdGbaB3JldmVyc2XaCk1FQU5fUElYRUwpAdoBeKkA\ncggAAAD6HjxpcHl0aG9uLWlucHV0LTctMDQ4N2UwNWZiMjQ3PtoIPGxhbWJkYT4KAAAAcwAAAAA=\n",
                null,
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "preprocess",
            "inbound_nodes": [[["vgg_input", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda",
            "inbound_nodes": [[["preprocess", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block1_conv1",
            "inbound_nodes": [[["lambda", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_1",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_1",
            "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv2",
              "trainable": false,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block1_conv2",
            "inbound_nodes": [[["lambda_1", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block1_pool",
              "trainable": false,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block1_pool",
            "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_2",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_2",
            "inbound_nodes": [[["block1_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block2_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block2_conv1",
            "inbound_nodes": [[["lambda_2", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_3",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_3",
            "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block2_conv2",
              "trainable": false,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block2_conv2",
            "inbound_nodes": [[["lambda_3", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block2_pool",
              "trainable": false,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block2_pool",
            "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_4",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_4",
            "inbound_nodes": [[["block2_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv1",
            "inbound_nodes": [[["lambda_4", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_5",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_5",
            "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv2",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv2",
            "inbound_nodes": [[["lambda_5", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_6",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_6",
            "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv3",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv3",
            "inbound_nodes": [[["lambda_6", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_7",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_7",
            "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv4",
              "trainable": false,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block3_conv4",
            "inbound_nodes": [[["lambda_7", 0, 0, {}]]]
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block3_pool",
              "trainable": false,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            },
            "name": "block3_pool",
            "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_8",
              "trainable": false,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNC0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_8",
            "inbound_nodes": [[["block3_pool", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "block4_conv1",
            "inbound_nodes": [[["lambda_8", 0, 0, {}]]]
          }
        ],
        "input_layers": [["vgg_input", 0, 0]],
        "output_layers": [["block4_conv1", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "block1_conv1/kernel",
          "shape": [3, 3, 3, 64],
          "dtype": "float32"
        },
        { "name": "block1_conv1/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "block1_conv2/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "block1_conv2/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "block2_conv1/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        { "name": "block2_conv1/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "block2_conv2/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "block2_conv2/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "block3_conv1/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv1/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block3_conv2/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv2/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block3_conv3/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv3/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block3_conv4/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "block3_conv4/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "block4_conv1/kernel",
          "shape": [3, 3, 256, 512],
          "dtype": "float32"
        },
        { "name": "block4_conv1/bias", "shape": [512], "dtype": "float32" }
      ]
    }
  ]
}
