{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4-tf",
  "convertedBy": "TensorFlow.js Converter v1.4.0",
  "modelTopology": {
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, null, 512],
              "dtype": "float32",
              "sparse": false,
              "name": "Decoder_input"
            },
            "name": "Decoder_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_16",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_16",
            "inbound_nodes": [[["Decoder_input", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv4_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv4_1",
            "inbound_nodes": [[["lambda_16", 0, 0, {}]]]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_3",
              "trainable": true,
              "dtype": "float32",
              "size": [2, 2],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_3",
            "inbound_nodes": [[["conv4_1", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_17",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_17",
            "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv3_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3_4",
            "inbound_nodes": [[["lambda_17", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_18",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_18",
            "inbound_nodes": [[["conv3_4", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv3_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3_3",
            "inbound_nodes": [[["lambda_18", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_19",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_19",
            "inbound_nodes": [[["conv3_3", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv3_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3_2",
            "inbound_nodes": [[["lambda_19", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_20",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_20",
            "inbound_nodes": [[["conv3_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv3_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv3_1",
            "inbound_nodes": [[["lambda_20", 0, 0, {}]]]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_4",
              "trainable": true,
              "dtype": "float32",
              "size": [2, 2],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_4",
            "inbound_nodes": [[["conv3_1", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_21",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_21",
            "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2_2",
            "inbound_nodes": [[["lambda_21", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_22",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_22",
            "inbound_nodes": [[["conv2_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2_1",
            "inbound_nodes": [[["lambda_22", 0, 0, {}]]]
          },
          {
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_5",
              "trainable": true,
              "dtype": "float32",
              "size": [2, 2],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "name": "up_sampling2d_5",
            "inbound_nodes": [[["conv2_1", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_23",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_23",
            "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1_2",
            "inbound_nodes": [[["lambda_23", 0, 0, {}]]]
          },
          {
            "class_name": "Lambda",
            "config": {
              "name": "lambda_24",
              "trainable": true,
              "dtype": "float32",
              "function": [
                "4wIAAAAAAAAAAgAAAAcAAABDAAAAcygAAAB0AGoBfABkAWQBZwJ8AXwBZwJ8AXwBZwJkAWQBZwJn\nBGQCZAONA1MAKQRO6QAAAADaCENPTlNUQU5UKQHaBG1vZGUpAtoCdGbaA3BhZCkC2gF42gdwYWRk\naW5nqQByCAAAAPoePGlweXRob24taW5wdXQtNS0zN2Y5YzFhMGMwY2M+cgUAAAACAAAAcwYAAAAA\nAgQBHAI=\n",
                [1],
                null
              ],
              "function_type": "lambda",
              "module": "__main__",
              "output_shape": null,
              "output_shape_type": "raw",
              "output_shape_module": null,
              "arguments": {}
            },
            "name": "lambda_24",
            "inbound_nodes": [[["conv1_2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv1_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 3,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv1_1",
            "inbound_nodes": [[["lambda_24", 0, 0, {}]]]
          }
        ],
        "input_layers": [["Decoder_input", 0, 0]],
        "output_layers": [["conv1_1", 0, 0]]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "conv1_1/kernel",
          "shape": [3, 3, 64, 3],
          "dtype": "float32"
        },
        { "name": "conv1_1/bias", "shape": [3], "dtype": "float32" },
        {
          "name": "conv1_2/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        { "name": "conv1_2/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2_1/kernel",
          "shape": [3, 3, 128, 64],
          "dtype": "float32"
        },
        { "name": "conv2_1/bias", "shape": [64], "dtype": "float32" },
        {
          "name": "conv2_2/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        { "name": "conv2_2/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv3_1/kernel",
          "shape": [3, 3, 256, 128],
          "dtype": "float32"
        },
        { "name": "conv3_1/bias", "shape": [128], "dtype": "float32" },
        {
          "name": "conv3_2/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "conv3_2/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "conv3_3/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "conv3_3/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "conv3_4/kernel",
          "shape": [3, 3, 256, 256],
          "dtype": "float32"
        },
        { "name": "conv3_4/bias", "shape": [256], "dtype": "float32" },
        {
          "name": "conv4_1/kernel",
          "shape": [3, 3, 512, 256],
          "dtype": "float32"
        },
        { "name": "conv4_1/bias", "shape": [256], "dtype": "float32" }
      ]
    }
  ]
}
